In [11]:
#series

import pandas as pd

temp = pd.Series([-20, -10, 10, 20], index = ['Jan', 'Feb', 'Mar', 'Apr'])
temp

Jan   -20
Feb   -10
Mar    10
Apr    20
dtype: int64

In [25]:
#Data Frame
import pandas as pd


data = {
    'Uni' : ['Kyushu', 'Seoul', 'Tokyo'], 'Conpany' : ['LGinnotek', 'Samsung Electrics', 'SK hynics'], 'name' : ['Rhodamine', 'Ted', 'Hines']
}

#df stands for data frame
df = pd.DataFrame(data, index = ['Student1', 'Student2', 'Student3'], columns = ['name', 'Uni'])

df

df[['name', 'Uni']]

               name     Uni
Student1  Rhodamine  Kyushu
Student2        Ted   Seoul
Student3      Hines   Tokyo